{
  "resources": [
    {
      "review": "Aaron was friendly, patient and extremely competent.",
      "author": "Leonard F.",
      "date": "04/29/2022"
    },
    {
      "review": "Aaron has been so patient with us! He was so helpful and educational in the home buying and loan process. He made sure we felt comfortable and answered all our questions. He was so kind to us even when our kids were yelling in the background lol he really has gone above and beyond for our family and we are thankful for him!",
      "author": "Isabella A.",
      "date": "04/29/22"
    },
    {
      "review": "Aaron has been amazing through this whole process! He’s very knowledgeable and timely with his work/responses. Even with a crazy and difficult market, Aaron was the best!",
      "author": "Sam T.",
      "date": "04/21/2022"
    },
    {
      "review": "Aaron was a breath of fresh air from previous experiences. He was very knowledgeable and made the whole process smooth and easy.",
      "author": "Matthew G.",
      "date": "02/07/2022"
    },
    {
      "review": "Aaron has been great he’s made the process as painless and possible, and with any hiccup along the way he’s done everything he can to help with a solution to help get us into a new house!",
      "author": "Kelsey W.",
      "date": "1/27/2022"
    },
    {
      "review": "Aaron is a top notch employee. He is knowledgeable, extremely easy to communicate, always responsive, going out of his way to provide 100% satisfaction for his customers. He’s an incredible asset to your company especially when there are many competitors in the market.",
      "author": "Young K.",
      "date": "01/03/2022"
    },
    {
      "review": "As a first time home buyer I was very nervous for the whole process and had a lot to learn. Aaron was amazing at explaining everything and his sense of humor made the whole experience fun! Thanks Aaron!",
      "author": "Kaitlyn T.",
      "date": "11/05/2021"
    },
    {
      "review": "Easiest person to work with and best customer service I’ve ever had",
      "author": "Bear R.",
      "date": "10/25/2021"
    },
    {
      "review": "Aaron is the best I have ever worked with. If I had a mortgage origination business I would do whatever it took to poach him from you. He is the consummate professional. Balanced, responsive, articulate, and extremely easy to work with.",
      "author": "Scott S.",
      "date": "09/30/2021"
    },
    {
      "review": "Exceptional customer service. Very responsive, knowledgeable, and client attentive. By far the best customer experience. Highly recommend",
      "author": "Jerome M.",
      "date": "09/12/2021"
    }
  ]
}
